import OrderedCollections

typealias Dicts = OrderedDictionary<String, (String, OrderedDictionary<String, Array<String>>)>

let dicts: Dicts = [
    "": (
        "unicode description",
        [
            "grinning face": ["😀"],
            "grinning face with big eyes": ["😃"],
            "grinning face with smiling eyes": ["😄"],
            "beaming face with smiling eyes": ["😁"],
        ]
    ),
    "hrkt": (
        "hiragana + katakana",
        [
            "a": ["あ", "ア"],
            "i": ["い", "イ"],
            "u": ["う", "ウ"],
            "e": ["え", "𛀀"],
            "o": ["お", "オ"],

            "A": ["ぁ", "ァ"],
            "I": ["ぃ", "ィ"],
            "U": ["ぅ", "ゥ"],
            "E": ["ぇ"],
            "O": ["ぉ", "ォ"],
            
            "ka": ["か", "カ"],
            "ki": ["き", "キ"],
            "ku": ["く", "ク"],
            "ke": ["け", "ケ"],
            "ko": ["こ", "コ"],

            "KA": ["ヵ"],
            "KU": ["ㇰ"],
            "KE": ["ヶ"],
            "KO": ["𛄲", "𛅕"],

            "ca": ["が", "ガ"],
            "ci": ["ぎ", "ギ"],
            "cu": ["ぐ", "グ"],
            "ce": ["げ", "ゲ"],
            "co": ["ご", "ゴ"],

            "sa": ["さ", "さ"],
            "si": ["し", "し"],
            "su": ["す", "す"],
            "se": ["せ", "せ"],
            "so": ["そ", "そ"],
            
            "SI": ["ㇱ"],
            "SU": ["ㇲ"],

            "za": ["ざ", "ザ"],
            "zi": ["じ", "ジ"],
            "zu": ["ず", "ズ"],
            "ze": ["ぜ", "ゼ"],
            "zo": ["ぞ", "ゾ"],

            "ta": ["た", "タ"],
            "ti": ["ち", "チ"],
            "tu": ["つ", "ツ"],
            "te": ["て", "テ"],
            "to": ["と", "ト"],

            "TU": ["ッ"],
            "TO": ["ㇳ"],

            "da": ["だ", "ダ"],
            "di": ["ぢ", "ヂ"],
            "du": ["づ", "ヅ"],
            "de": ["で", "デ"],
            "do": ["ど", "ド"],

            "na": ["な", "ナ"],
            "ni": ["に", "ニ"],
            "nu": ["ぬ", "ヌ"],
            "ne": ["ね", "ネ"],
            "no": ["の", "ノ"],

            "NU": ["ㇴ"],

            "fa": ["は", "ハ"],
            "fi": ["ひ", "ヒ"],
            "fu": ["ふ", "フ"],
            "fe": ["へ", "ヘ"],
            "fo": ["ほ", "ホ"],

            "FA": ["ㇵ"],
            "FI": ["ㇶ"],
            "FU": ["ㇷ"],
            "FE": ["ㇸ"],
            "FO": ["ㇹ"],
            
            "pa": ["ぱ", "パ"],
            "pi": ["ぴ", "ピ"],
            "pu": ["ぷ", "プ"],
            "pe": ["ぺ", "ペ"],
            "po": ["ぽ", "ポ"],
            
            "ma": ["ま", "マ"],
            "mi": ["み", "ミ"],
            "mu": ["む", "ム"],
            "me": ["め", "メ"],
            "mo": ["も", "モ"],

            "MU": ["ㇺ"],

            "ja": ["や", "ヤ"],
            "ji": ["𛀆", "𛄠"],
            "ju": ["ゆ", "ユ"],
            "je": ["𛀁", "エ", "𛄡"],
            "jo": ["よ", "ヨ"],

            "JA": ["ゃ", "ャ"],
            "JU": ["ゅ", "ュ"],
            "JE": ["ェ"],
            "JO": ["ょ", "ョ"],

            "ra": ["ら", "ラ"],
            "ri": ["り", "リ"],
            "ru": ["る", "ル"],
            "re": ["れ", "レ"],
            "ro": ["ろ", "ロ"],

            "RA": ["ㇻ"],
            "RI": ["ㇼ"],
            "RU": ["ㇽ"],
            "RE": ["ㇾ"],
            "RO": ["ㇿ"],
            
            "wa": ["わ", "ワ"],
            "wi": ["ゐ", "ヰ"],
            "wu": ["𛄟", "𛄢"],
            "we": ["ゑ", "ヱ"],
            "wo": ["を", "ヲ"],
            
            "WA": ["ゎ", "ヮ"],
            "WI": ["𛅐", "𛅤"],
            "WE": ["𛅑", "𛅥"],
            "WO": ["𛅒", "𛅦"],
            
            "va": ["ヷ"],
            "vi": ["ヸ"],
            "vu": ["ヴ"],
            "ve": ["ヹ"],
            "vo": ["ヺ"],
            
            "n": ["ん", "ン"],

            "N": ["𛅧"],
        ]
    ),
    
    "grek": (
        "greek",
        [
            "A": ["Α"],
        ]
    ),
    
    "cyrl": (
        "cyrillic",
        [
            "A": ["А"],
            "A/": ["А́"],
            "A\\": ["А̀"],
            "A>": ["А̂"],
            "A|": ["А̄"],
            "A(": ["Ӑ"],
            "A:": ["Ӓ"],
            "AO": ["А̊"],
            "AE": ["Ӕ"],
            
            "B": ["Б"],
            "V": ["В"],
            "C": ["Г"],
            "G": ["Ґ"],
            "D": ["Д"],
            "DJ": ["Ђ"],
            "C/": ["Ѓ"],

            "JE": ["Е", "Э"],
            "JE/": ["Е́", "Э́"],
            "JE\\": ["Ѐ"],
            "JE>": ["Е̂"],
            "JE|": ["Е̄"],
            "JE:": ["Ё"],

            "E": ["Є"],
            "E/": ["Є́"],

            "ZH": ["Ж"],
            "Z": ["З"],
            "Z/": ["З́"],
            "DZ": ["Ѕ"],
            "Z,": ["Ҙ"],
            
            "I": ["І", "И"],
            "I/": ["І́", "И́"],
            "I\\": ["Ї", "Ѝ"],
            "I^": ["И̂"],
            "I|": ["Ӣ"],
            "I(": ["Й"],
            "I:": ["Ӥ"],
            
            "J'": ["Ј"],
            "K": ["К"],
            "L": ["Л"],
            "LJ": ["Љ"],
            "M": ["М"],
            "N": ["Н"],
            "NJ": ["Њ"],
            
            "O": ["О"],
            "O/": ["О́"],
            "O\\": ["О̀"],
            "O>": ["О̂"],
            "O|": ["О̄"],
            "O:": ["Ӧ"],
            "O(": ["О̆"],
            "OE": ["Ө"],

            "P": ["П"],
            "R": ["Р"],

            "S": ["С"],
            "S/": ["С́"],
            "S,": ["Ҫ"],
            
            "T": ["Т"],
            "TJ": ["Ћ"],
            "K/": ["Ќ"],

            "U": ["У"],
            "U/": ["У́"],
            "U\\": ["У̀"],
            "U>": ["У̂"],
            "U|": ["Ӯ"],
            "U(": ["Ў"],
            "U:": ["Ӱ"],

            "F": ["Ф"],
            "X": ["Х"],
            "TS": ["Ц"],
            "TH": ["Ч"],
            "DH": ["Џ"],
            "SH": ["Ш"],
            "SHT": ["Щ"],

            "JW": ["Ꙏ"],
            "W": ["Ъ"],
            "W\\": ["Ъ̀"],
            "JI": ["Ы"],
            "JI/": ["Ы́"],
            "J": ["Ь"],
            "WI": ["Ꙑ"],
            
            "JO": ["Ю"],
            "JO/": ["Ю́"],
            "JO\\": ["Ю̀"],
            
            "JA": ["Я"],
            "JA/": ["Я́"],
            "JA\\": ["Я̀"],
            "IA'": ["Ꙗ"],
            
            "IE": ["Ѥ"],
            "EN": ["Ѧ"],
            "ON": ["Ѫ"],
            "IEN": ["Ѩ"],
            "ION": ["Ѭ"],

            "IOTA": ["Ꙇ"],
            "KS": ["Ѯ"],
            "PS": ["Ѱ"],
            "FITA": ["Ѳ"],
            "Y": ["Ѵ"],
            "Y\\\\": ["Ѷ"],
            "Q": ["Ҁ"],
            "OU": ["Ꙋ"],
            "OO": ["Ѡ"],
            "OO|": ["Ѿ"],
        ]
    )
]
