const { abugida } = require("./utility");

const dict = abugida(
  {
    " ": " ",

    ")": "\u0900",
    "(": "\u0901",
    n$: "\u0902",
    h$: "\u0903",

    "#a(": "ऄ",
    "#a": "अ",
    "#aa": "आ",
    "#i": "इ",
    "#ii": "ई",
    "#u": "उ",
    "#uu": "ऊ",
    "#r": "ऋ",
    "#l": "ऌ",
    "#e(": "ऍ",
    "#e": "ऎ",
    "#ai": "ए",
    "#aai": "ऐ",
    "#o(": "ऑ",
    "#o": "ऒ",
    "#au": "ओ",
    "#aau": "औ",

    "*": "\u093c", // nuqta
    "'": "ऽ",
    aun: "ॐ",

    "/": "\u0951", // high
    "\\": "\u0952", // low
    "//": "\u0953", // acute
    "\\\\": "\u0954", // grave

    "#rr": "ॠ",
    "#ll": "ॡ",

    ".": "।",
    "..": "॥",

    0: "०",
    1: "१",
    2: "२",
    3: "३",
    4: "४",
    5: "५",
    6: "६",
    7: "७",
    8: "८",
    9: "९",

    "''": "॰",
    "^.": "ॱ",

    "#ae": "ॲ",
    "#y": "ॳ",
    "#Y": "ॳ",
    "#au": "ॵ",
    "#w": "ॶ",
    "#W": "ॷ",
  },
  {
    q: "क",
    qh: "ख",
    c: "ग",
    ch: "घ",
    g: "ङ",

    k: "च",
    kh: "छ",
    z: "ज",
    zh: "झ",
    nj: "ञ",

    tr: "ट",
    trh: "ठ",
    dr: "ड",
    drh: "ढ",
    nr: "ण",

    t: "त",
    th: "थ",
    d: "द",
    dh: "ध",
    n: "न",
    "n*": "ऩ",

    l: "ल",

    p: "प",
    ph: "फ",
    b: "ब",
    bh: "भ",
    m: "म",

    j: "य",
    r: "र",
    "r*": "ऱ",
    lr: "ळ",
    "lr*": "ऴ",
    v: "व",

    x: "श",
    sr: "ष",
    s: "स",
    h: "ह",

    "q*": "क़",
    "qh*": "ख़",
    "ch*": "ग़",
    "z*": "ज़",
    "dr*": "ड़",
    "drh*": "ढ़",
    "ph*": "फ़",
    "j*": "य़",

    //"dr:": "ॸ",
    "z:": "ॹ",
    "j-": "ॺ",
    c_: "ॻ",
    z_: "ॼ",
    "q*": "ॽ",
    dr_: "ॾ",
    b_: "ॿ",
  },
  {
    y: "\u093A",
    Y: "\u093B",

    aa: "\u093E",
    i: "\u093F",
    ii: "\u0940",
    u: "\u0941",
    uu: "\u0942",
    r: "\u0943",
    rr: "\u0944",
    "e(": "\u0945",
    e: "\u0946",
    ai: "\u0947",
    aai: "\u0948",
    "o(": "\u0949",
    o: "\u094A",
    au: "\u094B",
    aau: "\u094C",
    "": "\u094D",

    "e*": "\u094E",
    av: "\u094f",
    yr: "\u0955",
    w: "\u0956",
    ww: "\u0957",

    l: "\u0962",
    L: "\u0963",
  },
);

require("fs").writeFileSync(
  __dirname + `/../../SumiInput/dicts.bundle/deva.json`,
  JSON.stringify(
    {
      name: "देवनागरी",
      dict,
    },
    null,
    2,
  ),
);
